[
  {
    "id": "chess-day1",
    "slug": "chess-day1",
    "title": "Chess Engine Day 1 Recap",
    "excerpt": "Day 1 of my handcrafted chess engine. No AI help or copying.",
    "publishedAt": "2026-02-17",
    "readTime": "5 min read",
    "tags": [
      "Progress",
      "Chess"
    ],
    "coverImage": "https://unsplash.com/photos/selective-focus-photography-of-chess-pieces-G1yhU1Ej-9A",
    "markdown": "### Recap:\n---\nEach day I work on this project I want to provide a little snapshot of my progress. Eventually I'll maybe start recording videos but it's hard at school with a roommate.\n\nFind the code for my Day 1 commit [here](https://github.com/dbartolai/chess/commit/e49a4b208cc43322da63d6791497e7074a9ad49b)\n\n### Brief Documentation:\n---\nToday I got started with two classes, `ChessGame` and `ChessMove`. \n\n`ChessMove` – A pydantic BaseModel I use to parse algebraic notation for chess moves into information I can use/store.\n- I'm not entirely sure how useful this will be, but I know I will need it to some degree.\n- Searches chess notation moves for the move number, the piece, square, check/mate, ...\n- Init function just accepts the move notation and the color that moved\n- Allows my board abstraction in `ChessGame` to interface with the notation\n\n`ChessGame` – Stores all of the data for an individual game\n- A board is initialized as a 2d numpy array with different `int` for the pieces. Black is negative.\n- Store a history of the moves as an array of `ChessMove` objects\n- Keeps status of checking rights on both sides\n- I created function declarations for move validation but they aren't done at all yet\n\n`main` – used for testing pretty much today\n\n### Thoughts:\n---\nI'm happy with my progress so far. As I develop, I'm keeping the idea of scaling this to an actual api in the back of my mind. It's important that everything is modular and clean; logic needs to be separated wherever possible. I think the logic for parsing chess notation into data I can use will prove super useful.\n\nThe core functionality for the game that I really need seems to be:\n- Move validation\n- Board storage\n- Notation parsing\n\nOnce those are complete, I will have an intereface for chess games that the computer *should* be able to understand. That's my first goal, and we can go for there.",
    "images": [],
    "videos": []
  },
  {
    "id": "chess-begin",
    "slug": "chess-begin",
    "title": "Starting my Chess Engine",
    "excerpt": "The beginnings of my handcrafted chess engine. No AI help or copying.",
    "publishedAt": "2026-02-17",
    "readTime": "5 min read",
    "tags": [
      "Ideas",
      "Learning"
    ],
    "coverImage": "https://unsplash.com/photos/selective-focus-photography-of-chess-pieces-G1yhU1Ej-9A",
    "markdown": "### Intro:\n---\nLately I've been getting really into *chess.* \n\nI just reached a 70 day streak on chess.com, and I'm pushing a 650 elo rating in the rapid games. The site is amazing, but I hate how they make you pay for a game review. I want to be able to review my games without paying for some subscription. So I decided to build and train my own chess engine.\n\nThe attached YouTube video also served as inspiration to me.\n\n### Parameters:\n---\nWhile this is a problem that has been widely solved, I want to approach it myself. Many people are losing critical thinking and programming skills because it's so easy to just generate code with a prompt. I'm not exempt from that group. So I won't be using AI at all to learn about move validation, training my bot, or anything.\n\nAt it's core, this will be a chess engine. I just want to create the backend logic that someone could then attach to a chess UI. I plan to be able to paste in chess notation copied from chess.com games to see how I played. The product should accomplish the following:\n\n- I want to be able to play games via the engine using chess notation. This should lay the groundwork to create an api endpoint and attach to a UI with a board, etc.\n    - To make this possible, I know I will need to store board state in memory\n- There shoould be some kind of bot that allows one-sided play, and I should also be allowed to play against someone else\n- Eventually, the engine should be able to accept finished games and review the play of both sides. \n    - I want to be able to paste in chess notation directly from my chess.com games\n    - It would be trivial to determine how both black and white played, and I will also compute which moves had big impacts on the outcomr\n\n### Initial Thoughts:\n---\nAdditionally, I don't know a lot about this problem. For example, I know I will need to create some artifact for the model. When I trained my XGBoost, for example, I train to minimize the cost by changing the weights according to some algorithm. I don't know how this will look or what chess engines do here.\n\nThe first step will definitely be creating a way to play games purely via chess notation. This will include move validation logic on both white and black. I think castling, en passant, and evaluating checks/checkmates will be the most difficult.\n\nNext, I need to figure out some way to actually train a bot to play against. The main problem is what do the weights/artifacts look like? I would assume that I will need two artifacts, one for black and one for white? Then I could just run a Monte Carlo simulation of many games, and just hope they get better by playing against each other. I've also heard of something called Alpha/Beta I think, but I need to do a bit of research.\n\n### Plan of Action:\n---\nI'm going to go out now and create the logic for the game itself. This will be in a python class called `ChessGame` or something like that. I will report back as I figrue things out.",
    "images": [],
    "videos": [
      {
        "title": "Chess Video",
        "url": "https://www.youtube.com/watch?v=pCbZYe2yoDo",
        "type": "embed"
      }
    ]
  }
]