[
    {
      "id": "signalboard",
      "slug": "signalboard",
      "name": "Signalboard",
      "tagline": "Real-time engineering operations cockpit.",
      "summary": "A monitoring dashboard that unifies logs, release health, and team ownership in a single interface.",
      "stack": ["Next.js", "TypeScript", "WebSockets", "PostgreSQL", "Tailwind CSS"],
      "year": "2025",
      "repoUrl": "https://github.com/example/signalboard",
      "demoUrl": "https://example.com/signalboard",
      "markdown": "## Why I built this\n\nTeams kept context-switching between logs, deploy feeds, and runbooks. Signalboard turns those streams into one readable command center.\n\n## Architecture notes\n\n- Event ingestion through a lightweight queue\n- Aggregation service for alert grouping\n- Frontend stream layer for live updates\n\n## What I learned\n\nI improved my data modeling instincts and got comfortable balancing expressive UI with strict performance budgets.",
      "images": [
        {
          "src": "https://picsum.photos/seed/signalboard-1/1280/720",
          "alt": "Signalboard overview dashboard"
        },
        {
          "src": "https://picsum.photos/seed/signalboard-2/1280/720",
          "alt": "Incident panel and ownership map"
        }
      ],
      "videos": [
        {
          "title": "Signalboard Product Walkthrough",
          "url": "https://www.youtube.com/embed/dQw4w9WgXcQ",
          "type": "embed"
        }
      ],
      "codeSamples": [
        {
          "filename": "streaming-client.ts",
          "language": "typescript",
          "code": "type StreamMessage = { channel: string; payload: unknown };\\n\\nexport function connectStream(url: string, onMessage: (msg: StreamMessage) => void) {\\n  const socket = new WebSocket(url);\\n\\n  socket.addEventListener('message', (event) => {\\n    const parsed = JSON.parse(event.data) as StreamMessage;\\n    onMessage(parsed);\\n  });\\n\\n  return () => socket.close();\\n}\\n"
        }
      ]
    },
      {
    "id": "ceria",
    "slug": "ceria",
    "name": "Ceria",
    "tagline": "Modular personal and academic workspace with agentic task and reflection workflows.",
    "summary": "A modular workspace system that isolates personal, academic, and startup contexts while providing agent-driven task creation, semantic search, and mastery-focused reflection tools.",
    "stack": [
      "React",
      "TypeScript",
      "FastAPI",
      "PostgreSQL",
      "Supabase",
      "asyncpg",
      "LangGraph",
      "Docker"
    ],
    "year": "2026",
    "repoUrl": "",
    "demoUrl": "",
    "markdown": "## Overview\n\nCeria is a modular workspace platform designed to support long-term learning, reflection, and project organization across multiple personal contexts. The system separates academic, startup, and personal workspaces while maintaining a unified interaction layer.\n\n## Architecture and System Design\n\nI designed a workspace isolation model that cleanly separates data and state across contexts while still enabling a shared agent infrastructure. This allows the same agent framework to operate safely across different personal and professional domains.\n\nThe interaction layer is built around a LangGraph-powered command interface that supports agentic task creation and semantic search through a spotlight-style command bar. This enables fast navigation, retrieval, and action execution across large personal knowledge bases.\n\n## Learning and Mastery Engine\n\nA core component of Ceria is a mastery engine that tracks user performance and spaced-repetition metadata to support long-term learning. Agent workflows generate personalized journal and reflection prompts designed to promote deeper understanding rather than surface-level recall.\n\nThese workflows combine user history, performance signals, and contextual retrieval to produce structured, goal-driven reflection sessions.\n\n## What I Learned\n\nCeria strengthened my ability to design agent-oriented systems that operate over long-lived personal data, and to reason about isolation boundaries, personalization, and workflow orchestration in learning-centric applications.",
    "images": [],
    "videos": [],
    "codeSamples": []
  }

    
  ]